# Proceso ETL del proyecto
Primero vamos a instalar las librerias necesarias.

In [26]:
%pip install sqlalchemy
%pip install psycopg2-binary
%pip install pandas

Requirement already satisfied: sqlalchemy in v:\ciencia de datos\customer-shopping-analytics\venv\lib\site-packages (2.0.38)
Requirement already satisfied: greenlet!=0.4.17 in v:\ciencia de datos\customer-shopping-analytics\venv\lib\site-packages (from sqlalchemy) (3.1.1)
Requirement already satisfied: typing-extensions>=4.6.0 in v:\ciencia de datos\customer-shopping-analytics\venv\lib\site-packages (from sqlalchemy) (4.12.2)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.2 -> 25.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

Requirement already satisfied: psycopg2-binary in v:\ciencia de datos\customer-shopping-analytics\venv\lib\site-packages (2.9.10)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.2 -> 25.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

Requirement already satisfied: pandas in v:\ciencia de datos\customer-shopping-analytics\venv\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in v:\ciencia de datos\customer-shopping-analytics\venv\lib\site-packages (from pandas) (2.2.3)
Requirement already satisfied: python-dateutil>=2.8.2 in v:\ciencia de datos\customer-shopping-analytics\venv\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in v:\ciencia de datos\customer-shopping-analytics\venv\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: tzdata>=2022.7 in v:\ciencia de datos\customer-shopping-analytics\venv\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: six>=1.5 in v:\ciencia de datos\customer-shopping-analytics\venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.2 -> 25.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

### Importamos las librerias necesarias

In [27]:
from sqlalchemy import create_engine, Column, Integer, String, Float, ForeignKey
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy.orm import sessionmaker, relationship
import pandas as pd
import re
import numpy as np

Se leen los datos del archivo csv

In [28]:
df = pd.read_csv('customer_shopping_data.csv')
df.head()

,invoice_no,customer_id,gender,age,category,quantity,price,payment_method,invoice_date,shopping_mall
0,I138884,C241288,Female,28,Clothing,5,1500.40,Credit Card,5/8/2022,Kanyon
1,I317333,C111565,Male,21,Shoes,3,1800.51,Debit Card,12/12/2021,Forum Istanbul
2,I127801,C266599,Male,20,Clothing,1,300.08,Cash,9/11/2021,Metrocity
3,I173702,C988172,Female,66,Shoes,5,3000.85,Credit Card,16/05/2021,Metropol AVM
4,I337046,C189076,Female,53,Books,4,60.60,Cash,24/10/2021,Kanyon

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99457 entries, 0 to 99456
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_no      99457 non-null  object
 1   customer_id     99457 non-null  object
 2   gender          99457 non-null  object
 3   age             99457 non-null  int64
 4   category        99457 non-null  object
 5   quantity        99457 non-null  int64
 6   price           99457 non-null  float64
 7   payment_method  99457 non-null  object
 8   invoice_date    99457 non-null  object
 9   shopping_mall   99457 non-null  object
dtypes: float64(1), int64(2), object(7)
memory usage: 7.6+ MB

Empezamos con la transformacion de los datos, primero verificamos si hay `duplicidad`.

In [30]:
duplicates = df[df.duplicated()]
print('Filas duplicadas')
duplicates

Filas duplicadas

Empty DataFrame
Columns: [invoice_no, customer_id, gender, age, category, quantity, price, payment_method, invoice_date, shopping_mall]
Index: []

Verificamos si hay `valores nulos` o `faltantes`.

In [31]:
df.isna().sum()

invoice_no        0
customer_id       0
gender            0
age               0
category          0
quantity          0
price             0
payment_method    0
invoice_date      0
shopping_mall     0
dtype: int64

Verificamos si hay `errores tipograficos`.`

In [32]:
typography = df["gender"].unique()
typography

array(['Female', 'Male'], dtype=object)

In [33]:
typography = df["category"].unique()
typography

array(['Clothing', 'Shoes', 'Books', 'Cosmetics', 'Food & Beverage',
       'Toys', 'Technology', 'Souvenir'], dtype=object)

In [34]:
typography3 = df["payment_method"].unique()
typography3

array(['Credit Card', 'Debit Card', 'Cash'], dtype=object)

Validamos los que los invoice_no y customer_id tengan los formatos correctos

In [35]:
# Expresión regular para validar invoice_no
pattern = re.compile(r'^I\d{6}$')

# Filtrar los invoice_no que no cumplen con el patrón
invalid_invoices = df[~df['invoice_no'].apply(lambda x: bool(pattern.match(x)))]

print('Códigos de invoice_no inválidos:')
invalid_invoices

Códigos de invoice_no inválidos:

Empty DataFrame
Columns: [invoice_no, customer_id, gender, age, category, quantity, price, payment_method, invoice_date, shopping_mall]
Index: []

In [36]:
# Expresión regular para validar customer_id
pattern = re.compile(r'^C\d{6}$')

# Filtrar los invoice_no que no cumplen con el patrón
invalid_customer = df[~df['customer_id'].apply(lambda x: bool(pattern.match(x)))]

print('Códigos de customer_id inválidos:')
invalid_customer

Códigos de customer_id inválidos:

Empty DataFrame
Columns: [invoice_no, customer_id, gender, age, category, quantity, price, payment_method, invoice_date, shopping_mall]
Index: []

Validacion de edades fuera de rango

In [37]:
df[(df["age"] < 18) | (df["age"] > 120)]

Empty DataFrame
Columns: [invoice_no, customer_id, gender, age, category, quantity, price, payment_method, invoice_date, shopping_mall]
Index: []

Estandarizacion del formato de fecha

In [38]:
df["invoice_date"] = pd.to_datetime(df["invoice_date"], format='%d/%m/%Y').dt.strftime('%Y-%m-%d')
df["invoice_date"].head()

0    2022-08-05
1    2021-12-12
2    2021-11-09
3    2021-05-16
4    2021-10-24
Name: invoice_date, dtype: object

### **Creacion de la tabla hecho y tablas dimensiones**

In [39]:
print('Creando tabla dimShoppingMall')
shopping_m = df[["invoice_no","shopping_mall"]].copy()
shopping_m["city"] = np.nan
shopping_m["country"] = np.nan
shopping_m["id_shopping_mall"] = shopping_m.index + 1
shopping_m

Creando tabla dimShoppingMall

      invoice_no     shopping_mall  city  country  id_shopping_mall
0        I138884            Kanyon   NaN      NaN                 1
1        I317333    Forum Istanbul   NaN      NaN                 2
2        I127801         Metrocity   NaN      NaN                 3
3        I173702      Metropol AVM   NaN      NaN                 4
4        I337046            Kanyon   NaN      NaN                 5
...          ...               ...   ...      ...               ...
99452    I219422            Kanyon   NaN      NaN             99453
99453    I325143    Forum Istanbul   NaN      NaN             99454
99454    I824010         Metrocity   NaN      NaN             99455
99455    I702964      Istinye Park   NaN      NaN             99456
99456    I232867  Mall of Istanbul   NaN      NaN             99457

[99457 rows x 5 columns]

In [40]:
print('Agregando id_shopping_mall a la tabla de hechos')
df = df.merge(shopping_m[['invoice_no','id_shopping_mall']], on='invoice_no', how='left')
df = df.drop(columns=['shopping_mall'])
df

Agregando id_shopping_mall a la tabla de hechos

,invoice_no,customer_id,gender,age,category,quantity,price,payment_method,invoice_date,id_shopping_mall
0,I138884,C241288,Female,28,Clothing,5,1500.40,Credit Card,2022-08-05,1
1,I317333,C111565,Male,21,Shoes,3,1800.51,Debit Card,2021-12-12,2
2,I127801,C266599,Male,20,Clothing,1,300.08,Cash,2021-11-09,3
3,I173702,C988172,Female,66,Shoes,5,3000.85,Credit Card,2021-05-16,4
4,I337046,C189076,Female,53,Books,4,60.60,Cash,2021-10-24,5
...,...,...,...,...,...,...,...,...,...,...
99452,I219422,C441542,Female,45,Souvenir,5,58.65,Credit Card,2022-09-21,99453
99453,I325143,C569580,Male,27,Food & Beverage,2,10.46,Cash,2021-09-22,99454
99454,I824010,C103292,Male,63,Food & Beverage,2,10.46,Debit Card,2021-03-28,99455
99455,I702964,C800631,Male,56,Technology,4,4200.00,Cash,2021-03-16,99456
99456,I232867,C273973,Female,36,Souvenir,3,35.19,Credit Card,2022-10-15,99457

In [41]:
print('Creando tabla dimCustomer')
customer = df[["invoice_no","customer_id", "gender", "age"]].copy()
customer["first_name"] = np.nan
customer["last_name"] = np.nan
customer["id_customer"] = customer.index + 1
customer

Creando tabla dimCustomer

      invoice_no customer_id  gender  age  first_name  last_name  id_customer
0        I138884     C241288  Female   28         NaN        NaN            1
1        I317333     C111565    Male   21         NaN        NaN            2
2        I127801     C266599    Male   20         NaN        NaN            3
3        I173702     C988172  Female   66         NaN        NaN            4
4        I337046     C189076  Female   53         NaN        NaN            5
...          ...         ...     ...  ...         ...        ...          ...
99452    I219422     C441542  Female   45         NaN        NaN        99453
99453    I325143     C569580    Male   27         NaN        NaN        99454
99454    I824010     C103292    Male   63         NaN        NaN        99455
99455    I702964     C800631    Male   56         NaN        NaN        99456
99456    I232867     C273973  Female   36         NaN        NaN        99457

[99457 rows x 7 columns]

In [42]:
print('Agregando id_customer a la tabla de hechos')
df = df.merge(customer[['invoice_no','id_customer']], on='invoice_no', how='left')
df = df.drop(columns=['customer_id','gender', 'age'])
df

Agregando id_customer a la tabla de hechos

,invoice_no,category,quantity,price,payment_method,invoice_date,id_shopping_mall,id_customer
0,I138884,Clothing,5,1500.40,Credit Card,2022-08-05,1,1
1,I317333,Shoes,3,1800.51,Debit Card,2021-12-12,2,2
2,I127801,Clothing,1,300.08,Cash,2021-11-09,3,3
3,I173702,Shoes,5,3000.85,Credit Card,2021-05-16,4,4
4,I337046,Books,4,60.60,Cash,2021-10-24,5,5
...,...,...,...,...,...,...,...,...
99452,I219422,Souvenir,5,58.65,Credit Card,2022-09-21,99453,99453
99453,I325143,Food & Beverage,2,10.46,Cash,2021-09-22,99454,99454
99454,I824010,Food & Beverage,2,10.46,Debit Card,2021-03-28,99455,99455
99455,I702964,Technology,4,4200.00,Cash,2021-03-16,99456,99456
99456,I232867,Souvenir,3,35.19,Credit Card,2022-10-15,99457,99457

In [43]:
print('Creando tabla dimCategory')
category = df[["invoice_no","category"]].copy()
category["description"] = np.nan
category["id_category"] = category.index + 1
category

Creando tabla dimCategory

      invoice_no         category  description  id_category
0        I138884         Clothing          NaN            1
1        I317333            Shoes          NaN            2
2        I127801         Clothing          NaN            3
3        I173702            Shoes          NaN            4
4        I337046            Books          NaN            5
...          ...              ...          ...          ...
99452    I219422         Souvenir          NaN        99453
99453    I325143  Food & Beverage          NaN        99454
99454    I824010  Food & Beverage          NaN        99455
99455    I702964       Technology          NaN        99456
99456    I232867         Souvenir          NaN        99457

[99457 rows x 4 columns]

In [44]:
print('Agregando id_category a la tabla de hechos')
df = df.merge(category[['invoice_no','id_category']], on='invoice_no', how='left')
df = df.drop(columns=['category'])
df

Agregando id_category a la tabla de hechos

,invoice_no,quantity,price,payment_method,invoice_date,id_shopping_mall,id_customer,id_category
0,I138884,5,1500.40,Credit Card,2022-08-05,1,1,1
1,I317333,3,1800.51,Debit Card,2021-12-12,2,2,2
2,I127801,1,300.08,Cash,2021-11-09,3,3,3
3,I173702,5,3000.85,Credit Card,2021-05-16,4,4,4
4,I337046,4,60.60,Cash,2021-10-24,5,5,5
...,...,...,...,...,...,...,...,...
99452,I219422,5,58.65,Credit Card,2022-09-21,99453,99453,99453
99453,I325143,2,10.46,Cash,2021-09-22,99454,99454,99454
99454,I824010,2,10.46,Debit Card,2021-03-28,99455,99455,99455
99455,I702964,4,4200.00,Cash,2021-03-16,99456,99456,99456
99456,I232867,3,35.19,Credit Card,2022-10-15,99457,99457,99457

In [45]:
print('Creando tabla dimInvoiceDate')
date = df[["invoice_no", "invoice_date"]].copy()
date['day'] = pd.to_datetime(date["invoice_date"]).dt.day
date['month'] = pd.to_datetime(date["invoice_date"]).dt.month
date['year'] = pd.to_datetime(date["invoice_date"]).dt.year
date = date.drop(columns=['invoice_date'])
date["id_invoice_date"] = date.index + 1
date

Creando tabla dimInvoiceDate

      invoice_no  day  month  year  id_invoice_date
0        I138884    5      8  2022                1
1        I317333   12     12  2021                2
2        I127801    9     11  2021                3
3        I173702   16      5  2021                4
4        I337046   24     10  2021                5
...          ...  ...    ...   ...              ...
99452    I219422   21      9  2022            99453
99453    I325143   22      9  2021            99454
99454    I824010   28      3  2021            99455
99455    I702964   16      3  2021            99456
99456    I232867   15     10  2022            99457

[99457 rows x 5 columns]

In [46]:
print('Agregando id_invoice_date a la tabla de hechos')
df = df.merge(date[['invoice_no','id_invoice_date']], on='invoice_no', how='left')
df = df.drop(columns=['invoice_date'])
df

Agregando id_invoice_date a la tabla de hechos

,invoice_no,quantity,price,payment_method,id_shopping_mall,id_customer,id_category,id_invoice_date
0,I138884,5,1500.40,Credit Card,1,1,1,1
1,I317333,3,1800.51,Debit Card,2,2,2,2
2,I127801,1,300.08,Cash,3,3,3,3
3,I173702,5,3000.85,Credit Card,4,4,4,4
4,I337046,4,60.60,Cash,5,5,5,5
...,...,...,...,...,...,...,...,...
99452,I219422,5,58.65,Credit Card,99453,99453,99453,99453
99453,I325143,2,10.46,Cash,99454,99454,99454,99454
99454,I824010,2,10.46,Debit Card,99455,99455,99455,99455
99455,I702964,4,4200.00,Cash,99456,99456,99456,99456
99456,I232867,3,35.19,Credit Card,99457,99457,99457,99457

In [47]:
print('Creando tabla dimPaymentMethod')
payment_method = df[["invoice_no", "payment_method"]].copy()
payment_method["payment_gateway"] = np.nan
payment_method["currency"] = np.nan
payment_method["commission"] = np.nan
payment_method["id_payment_method"] = date.index + 1
payment_method

Creando tabla dimPaymentMethod

,invoice_no,payment_method,payment_gateway,currency,commission,id_payment_method
0,I138884,Credit Card,NaN,NaN,NaN,1
1,I317333,Debit Card,NaN,NaN,NaN,2
2,I127801,Cash,NaN,NaN,NaN,3
3,I173702,Credit Card,NaN,NaN,NaN,4
4,I337046,Cash,NaN,NaN,NaN,5
...,...,...,...,...,...,...
99452,I219422,Credit Card,NaN,NaN,NaN,99453
99453,I325143,Cash,NaN,NaN,NaN,99454
99454,I824010,Debit Card,NaN,NaN,NaN,99455
99455,I702964,Cash,NaN,NaN,NaN,99456
99456,I232867,Credit Card,NaN,NaN,NaN,99457

In [48]:
print('Agregando id_payment_method a la tabla de hechos')
df = df.merge(payment_method[['invoice_no','id_payment_method']], on='invoice_no', how='left')
df = df.drop(columns=['payment_method'])
factSales = df
factSales

Agregando id_payment_method a la tabla de hechos

,invoice_no,quantity,price,id_shopping_mall,id_customer,id_category,id_invoice_date,id_payment_method
0,I138884,5,1500.40,1,1,1,1,1
1,I317333,3,1800.51,2,2,2,2,2
2,I127801,1,300.08,3,3,3,3,3
3,I173702,5,3000.85,4,4,4,4,4
4,I337046,4,60.60,5,5,5,5,5
...,...,...,...,...,...,...,...,...
99452,I219422,5,58.65,99453,99453,99453,99453,99453
99453,I325143,2,10.46,99454,99454,99454,99454,99454
99454,I824010,2,10.46,99455,99455,99455,99455,99455
99455,I702964,4,4200.00,99456,99456,99456,99456,99456
99456,I232867,3,35.19,99457,99457,99457,99457,99457

### Conexion a base de datos

In [49]:
# Conectar a PostgreSQL
DATABASE_URL="postgresql://project1_cdd_db_owner:npg_52oPJzylMEbA@ep-silent-cell-a4z5hbun-pooler.us-east-1.aws.neon.tech/project1_cdd_db?sslmode=require"
engine = create_engine(DATABASE_URL)
Base = declarative_base()

class ShoppingMall(Base):
    __tablename__ = 'dimShoppingMall'
    id_shopping_mall = Column(Integer, primary_key=True)
    shopping_mall = Column(String)
    city = Column(String)
    country = Column(String)
    sales = relationship('FactSales', backref='dimShoppingMall')

class Customer(Base):
    __tablename__ = 'dimCustomer'
    id_customer = Column(String, primary_key=True)
    first_name = Column(String)
    last_name = Column(String)
    gender = Column(String)
    age = Column(Integer)
    sales = relationship('FactSales', backref='dimCustomer')

class Category(Base):
    __tablename__ = 'dimCategory'
    id_category = Column(Integer, primary_key=True)
    category = Column(String)
    description = Column(String)
    sales = relationship('FactSales', backref='dimCategory')

class InvoiceDate(Base):
    __tablename__ = 'dimInvoiceDate'
    id_invoice_date = Column(Integer, primary_key=True)
    day = Column(Integer)
    month = Column(Integer)
    year = Column(Integer)
    sales = relationship('FactSales', backref='dimInvoiceDate')

class PaymentMethod(Base):
    __tablename__ = 'dimPaymentMethod'
    id_payment_method = Column(Integer, primary_key=True)
    payment_method = Column(String)
    payment_gateway = Column(String)
    currency = Column(String)
    commission = Column(Float)
    sales = relationship('FactSales', backref='dimPaymentMethod')

class FactSales(Base):
    __tablename__ = 'factSales'
    invoice_no = Column(String, primary_key=True)
    id_customer = Column(String, ForeignKey('dimCustomer.id_customer'))
    id_category = Column(Integer, ForeignKey('dimCategory.id_category'))
    id_invoice_date = Column(Integer, ForeignKey('dimInvoiceDate.id_invoice_date'))
    id_payment_method = Column(Integer, ForeignKey('dimPaymentMethod.id_payment_method'))
    id_shopping_mall = Column(Integer, ForeignKey('dimShoppingMall.id_shopping_mall'))
    quantity = Column(Integer)
    price = Column(Float)

    shopphing_mall = relationship('ShoppingMall', backref='factSales')
    customer = relationship('Customer', backref='factSales')
    category = relationship('Category', backref='factSales')
    invoice_date = relationship('InvoiceDate', backref='factSales')
    payment_method = relationship('PaymentMethod', backref='factSales')

# Crear todas las tablas
Base.metadata.create_all(engine)

# Crear una sesión
Session = sessionmaker(bind=engine)
session = Session()

# Insertar datos en las tablas
for index, row in category.iterrows():
    session.add(Category(id_category=row['id_category'], category=row['category'], description=row['description']))

for index, row in payment_method.iterrows():
    session.add(PaymentMethod(
        id_payment_method=row['id_payment_method'], 
        payment_method=row['payment_method'], 
        payment_gateway=row['payment_gateway'], 
        currency=row['currency'], 
        commission=row['commission']))

for index, row in date.iterrows():
    session.add(InvoiceDate(id_invoice_date=row['id_invoice_date'], day=row['day'], month=row['month'], year=row['year']))

for index, row in shopping_m.iterrows():
    session.add(ShoppingMall(id_shopping_mall=row['id_shopping_mall'], shopping_mall=row['shopping_mall'], city=row['city'], country=row['country']))

for index, row in customer.iterrows():
    session.add(Customer(id_customer=row['id_customer'], first_name=row['first_name'], last_name=row['last_name'], gender=row['gender'], age=row['age']))

for index, row in factSales.iterrows():
    session.add(FactSales(
        invoice_no=row['invoice_no'], 
        id_customer=row['id_customer'], 
        id_shopping_mall=row['id_shopping_mall'], 
        id_category=row['id_category'], 
        id_invoice_date=row['id_invoice_date'], 
        id_payment_method=row['id_payment_method'], 
        quantity=row['quantity'], 
        price=row['price']))

# Confirmar la transacción
session.commit()
session.close()
print('Datos insertados en la base de datos')

C:\Users\cifu1\AppData\Local\Temp\ipykernel_9616\2842896135.py:4: MovedIn20Warning: The ``declarative_base()`` function is now available as sqlalchemy.orm.declarative_base(). (deprecated since: 2.0) (Background on SQLAlchemy 2.0 at: https://sqlalche.me/e/b8d9)
  Base = declarative_base()
C:\Users\cifu1\AppData\Local\Temp\ipykernel_9616\2842896135.py:73: SAWarning: relationship 'ShoppingMall.factSales' will copy column dimShoppingMall.id_shopping_mall to column factSales.id_shopping_mall, which conflicts with relationship(s): 'FactSales.dimShoppingMall' (copies dimShoppingMall.id_shopping_mall to factSales.id_shopping_mall), 'ShoppingMall.sales' (copies dimShoppingMall.id_shopping_mall to factSales.id_shopping_mall). If this is not the intention, consider if these relationships should be linked with back_populates, or if viewonly=True should be applied to one or more if they are read-only. For the less common case that foreign key constraints are partially overlapping, the orm.foreign() annotation can be used to isolate the columns that should be written towards.   To silence this warning, add the parameter 'overlaps="dimShoppingMall,sales"' to the 'ShoppingMall.factSales' relationship. (Background on this warning at: https://sqlalche.me/e/20/qzyx) (This warning originated from the `configure_mappers()` process, which was invoked automatically in response to a user-initiated operation.)
  session.add(Category(id_category=row['id_category'], category=row['category'], description=row['description']))
C:\Users\cifu1\AppData\Local\Temp\ipykernel_9616\2842896135.py:73: SAWarning: relationship 'FactSales.shopphing_mall' will copy column dimShoppingMall.id_shopping_mall to column factSales.id_shopping_mall, which conflicts with relationship(s): 'FactSales.dimShoppingMall' (copies dimShoppingMall.id_shopping_mall to factSales.id_shopping_mall), 'ShoppingMall.sales' (copies dimShoppingMall.id_shopping_mall to factSales.id_shopping_mall). If this is not the intention, consider if these relationships should be linked with back_populates, or if viewonly=True should be applied to one or more if they are read-only. For the less common case that foreign key constraints are partially overlapping, the orm.foreign() annotation can be used to isolate the columns that should be written towards.   To silence this warning, add the parameter 'overlaps="dimShoppingMall,sales"' to the 'FactSales.shopphing_mall' relationship. (Background on this warning at: https://sqlalche.me/e/20/qzyx) (This warning originated from the `configure_mappers()` process, which was invoked automatically in response to a user-initiated operation.)
  session.add(Category(id_category=row['id_category'], category=row['category'], description=row['description']))
C:\Users\cifu1\AppData\Local\Temp\ipykernel_9616\2842896135.py:73: SAWarning: relationship 'Customer.factSales' will copy column dimCustomer.id_customer to column factSales.id_customer, which conflicts with relationship(s): 'Customer.sales' (copies dimCustomer.id_customer to factSales.id_customer), 'FactSales.dimCustomer' (copies dimCustomer.id_customer to factSales.id_customer). If this is not the intention, consider if these relationships should be linked with back_populates, or if viewonly=True should be applied to one or more if they are read-only. For the less common case that foreign key constraints are partially overlapping, the orm.foreign() annotation can be used to isolate the columns that should be written towards.   To silence this warning, add the parameter 'overlaps="dimCustomer,sales"' to the 'Customer.factSales' relationship. (Background on this warning at: https://sqlalche.me/e/20/qzyx) (This warning originated from the `configure_mappers()` process, which was invoked automatically in response to a user-initiated operation.)
  session.add(Category(id_category=row['id_category'], category=row['category'], description=row['description']))
C:\Users\cifu1\AppData\Local\Temp\ipykernel_9616\2842896135.py:73: SAWarning: relationship 'FactSales.customer' will copy column dimCustomer.id_customer to column factSales.id_customer, which conflicts with relationship(s): 'Customer.sales' (copies dimCustomer.id_customer to factSales.id_customer), 'FactSales.dimCustomer' (copies dimCustomer.id_customer to factSales.id_customer). If this is not the intention, consider if these relationships should be linked with back_populates, or if viewonly=True should be applied to one or more if they are read-only. For the less common case that foreign key constraints are partially overlapping, the orm.foreign() annotation can be used to isolate the columns that should be written towards.   To silence this warning, add the parameter 'overlaps="dimCustomer,sales"' to the 'FactSales.customer' relationship. (Background on this warning at: https://sqlalche.me/e/20/qzyx) (This warning originated from the `configure_mappers()` process, which was invoked automatically in response to a user-initiated operation.)
  session.add(Category(id_category=row['id_category'], category=row['category'], description=row['description']))
C:\Users\cifu1\AppData\Local\Temp\ipykernel_9616\2842896135.py:73: SAWarning: relationship 'Category.factSales' will copy column dimCategory.id_category to column factSales.id_category, which conflicts with relationship(s): 'Category.sales' (copies dimCategory.id_category to factSales.id_category), 'FactSales.dimCategory' (copies dimCategory.id_category to factSales.id_category). If this is not the intention, consider if these relationships should be linked with back_populates, or if viewonly=True should be applied to one or more if they are read-only. For the less common case that foreign key constraints are partially overlapping, the orm.foreign() annotation can be used to isolate the columns that should be written towards.   To silence this warning, add the parameter 'overlaps="dimCategory,sales"' to the 'Category.factSales' relationship. (Background on this warning at: https://sqlalche.me/e/20/qzyx) (This warning originated from the `configure_mappers()` process, which was invoked automatically in response to a user-initiated operation.)
  session.add(Category(id_category=row['id_category'], category=row['category'], description=row['description']))
C:\Users\cifu1\AppData\Local\Temp\ipykernel_9616\2842896135.py:73: SAWarning: relationship 'FactSales.category' will copy column dimCategory.id_category to column factSales.id_category, which conflicts with relationship(s): 'Category.sales' (copies dimCategory.id_category to factSales.id_category), 'FactSales.dimCategory' (copies dimCategory.id_category to factSales.id_category). If this is not the intention, consider if these relationships should be linked with back_populates, or if viewonly=True should be applied to one or more if they are read-only. For the less common case that foreign key constraints are partially overlapping, the orm.foreign() annotation can be used to isolate the columns that should be written towards.   To silence this warning, add the parameter 'overlaps="dimCategory,sales"' to the 'FactSales.category' relationship. (Background on this warning at: https://sqlalche.me/e/20/qzyx) (This warning originated from the `configure_mappers()` process, which was invoked automatically in response to a user-initiated operation.)
  session.add(Category(id_category=row['id_category'], category=row['category'], description=row['description']))
C:\Users\cifu1\AppData\Local\Temp\ipykernel_9616\2842896135.py:73: SAWarning: relationship 'InvoiceDate.factSales' will copy column dimInvoiceDate.id_invoice_date to column factSales.id_invoice_date, which conflicts with relationship(s): 'FactSales.dimInvoiceDate' (copies dimInvoiceDate.id_invoice_date to factSales.id_invoice_date), 'InvoiceDate.sales' (copies dimInvoiceDate.id_invoice_date to factSales.id_invoice_date). If this is not the intention, consider if these relationships should be linked with back_populates, or if viewonly=True should be applied to one or more if they are read-only. For the less common case that foreign key constraints are partially overlapping, the orm.foreign() annotation can be used to isolate the columns that should be written towards.   To silence this warning, add the parameter 'overlaps="dimInvoiceDate,sales"' to the 'InvoiceDate.factSales' relationship. (Background on this warning at: https://sqlalche.me/e/20/qzyx) (This warning originated from the `configure_mappers()` process, which was invoked automatically in response to a user-initiated operation.)
  session.add(Category(id_category=row['id_category'], category=row['category'], description=row['description']))
C:\Users\cifu1\AppData\Local\Temp\ipykernel_9616\2842896135.py:73: SAWarning: relationship 'FactSales.invoice_date' will copy column dimInvoiceDate.id_invoice_date to column factSales.id_invoice_date, which conflicts with relationship(s): 'FactSales.dimInvoiceDate' (copies dimInvoiceDate.id_invoice_date to factSales.id_invoice_date), 'InvoiceDate.sales' (copies dimInvoiceDate.id_invoice_date to factSales.id_invoice_date). If this is not the intention, consider if these relationships should be linked with back_populates, or if viewonly=True should be applied to one or more if they are read-only. For the less common case that foreign key constraints are partially overlapping, the orm.foreign() annotation can be used to isolate the columns that should be written towards.   To silence this warning, add the parameter 'overlaps="dimInvoiceDate,sales"' to the 'FactSales.invoice_date' relationship. (Background on this warning at: https://sqlalche.me/e/20/qzyx) (This warning originated from the `configure_mappers()` process, which was invoked automatically in response to a user-initiated operation.)
  session.add(Category(id_category=row['id_category'], category=row['category'], description=row['description']))
C:\Users\cifu1\AppData\Local\Temp\ipykernel_9616\2842896135.py:73: SAWarning: relationship 'PaymentMethod.factSales' will copy column dimPaymentMethod.id_payment_method to column factSales.id_payment_method, which conflicts with relationship(s): 'FactSales.dimPaymentMethod' (copies dimPaymentMethod.id_payment_method to factSales.id_payment_method), 'PaymentMethod.sales' (copies dimPaymentMethod.id_payment_method to factSales.id_payment_method). If this is not the intention, consider if these relationships should be linked with back_populates, or if viewonly=True should be applied to one or more if they are read-only. For the less common case that foreign key constraints are partially overlapping, the orm.foreign() annotation can be used to isolate the columns that should be written towards.   To silence this warning, add the parameter 'overlaps="dimPaymentMethod,sales"' to the 'PaymentMethod.factSales' relationship. (Background on this warning at: https://sqlalche.me/e/20/qzyx) (This warning originated from the `configure_mappers()` process, which was invoked automatically in response to a user-initiated operation.)
  session.add(Category(id_category=row['id_category'], category=row['category'], description=row['description']))
C:\Users\cifu1\AppData\Local\Temp\ipykernel_9616\2842896135.py:73: SAWarning: relationship 'FactSales.payment_method' will copy column dimPaymentMethod.id_payment_method to column factSales.id_payment_method, which conflicts with relationship(s): 'FactSales.dimPaymentMethod' (copies dimPaymentMethod.id_payment_method to factSales.id_payment_method), 'PaymentMethod.sales' (copies dimPaymentMethod.id_payment_method to factSales.id_payment_method). If this is not the intention, consider if these relationships should be linked with back_populates, or if viewonly=True should be applied to one or more if they are read-only. For the less common case that foreign key constraints are partially overlapping, the orm.foreign() annotation can be used to isolate the columns that should be written towards.   To silence this warning, add the parameter 'overlaps="dimPaymentMethod,sales"' to the 'FactSales.payment_method' relationship. (Background on this warning at: https://sqlalche.me/e/20/qzyx) (This warning originated from the `configure_mappers()` process, which was invoked automatically in response to a user-initiated operation.)
  session.add(Category(id_category=row['id_category'], category=row['category'], description=row['description']))

Datos insertados en la base de datos